---
kind: property
id: P:Autodesk.Revit.DB.DeleteWorksetSettings.WorksetId
source: html/93d2f9b1-d9b0-0ce1-66e0-b9d464be9074.htm
---
# Autodesk.Revit.DB.DeleteWorksetSettings.WorksetId Property

The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.

## Syntax (C#)
```csharp
public WorksetId WorksetId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null